app/controllers/carts_controller.rb

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 10 Nov 2012 02:01:22 UTC +00:00], ["updated_at", Sat, 10 Nov 2012 02:01:22 UTC +00:00]]

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]