app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 10 Nov 2012 02:01:22 UTC +00:00], ["updated_at", Sat, 10 Nov 2012 02:01:22 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Sat, 10 Nov 2012 04:58:39 UTC +00:00], ["order_id", nil], ["product_id", 207281424], ["quantity", 1], ["updated_at", Sat, 10 Nov 2012 04:58:39 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy