app/controllers/products_controller.rb

    def create
        @product = Product.new(params[:product])

        respond_to do |format|
            if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        @product = Product.find(params[:id])

        respond_to do |format|
            if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "products" SET "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "price" = 19.95, "updated_at" = '2012-11-09 22:30:25.177636' WHERE "products"."id" = 980190962